# 6) Opeations

In [0]:
import numpy as np
import pandas as pd

In [0]:
d = {'col1':[1,2,3,4],
     'col2':[45,55,65,45],
     'col3':['asd','jkl','qwe','xyz']}

In [3]:
df=pd.DataFrame(d)
df

   col1  col2 col3
0     1    45  asd
1     2    55  jkl
2     3    65  qwe
3     4    45  xyz

In [4]:
df['col2'].unique()

array([45, 55, 65])

In [5]:
len(df['col2'].unique())

3

In [6]:
df['col2'].nunique()

3

In [7]:
df['col2'].value_counts()

45    2
55    1
65    1
Name: col2, dtype: int64

In [0]:
# apply method

In [0]:
def times5(x):
  return x*5

In [9]:
times5(10)

50

In [10]:
df['col1'].sum()

10

In [11]:
df

   col1  col2 col3
0     1    45  asd
1     2    55  jkl
2     3    65  qwe
3     4    45  xyz

In [12]:
df['col1'].apply(times5)

0     5
1    10
2    15
3    20
Name: col1, dtype: int64

In [13]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [14]:
df.drop('col1',axis=1)

   col2 col3
0    45  asd
1    55  jkl
2    65  qwe
3    45  xyz

In [15]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [16]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [17]:
df.sort_values('col2')

   col1  col2 col3
0     1    45  asd
3     4    45  xyz
1     2    55  jkl
2     3    65  qwe

In [18]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# 7) Reading and Writing files in Pandas

## Reading and writing CSV Files

In [0]:
import pandas as pd

In [0]:
pwd

'/content'

In [0]:
pd.read_csv('/content/test.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [0]:
b = pd.read_csv('/content/test.csv')

In [0]:
b

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [0]:
d = {'name':['Sara','Tom','Mark','Vinny'],
     'score':[75,80,85,90],
     'number':[22,25,27,30]}

In [0]:
d

{'name': ['Sara', 'Tom', 'Mark', 'Vinny'],
 'number': [22, 25, 27, 30],
 'score': [75, 80, 85, 90]}

In [0]:
df = pd.DataFrame(d)

In [0]:
df

    name  score  number
0   Sara     75      22
1    Tom     80      25
2   Mark     85      27
3  Vinny     90      30

In [0]:
df.to_csv('test_2.csv')

In [0]:
pd.read_csv('/content/test_2.csv',index_col=0)

    name  score  number
0   Sara     75      22
1    Tom     80      25
2   Mark     85      27
3  Vinny     90      30

## Reading and writing Excel files

In [0]:
pd.read_excel('/content/test.xlsx',index_col=0,sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [0]:
df

    name  score  number
0   Sara     75      22
1    Tom     80      25
2   Mark     85      27
3  Vinny     90      30

In [0]:
df.to_excel('test_2.xlsx',sheet_name='Sheet1')

In [0]:
pd.read_excel('/content/test_2.xlsx',index_col=0)

    name  score  number
0   Sara     75      22
1    Tom     80      25
2   Mark     85      27
3  Vinny     90      30